{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.8.5"},"varInspector":{"cols":{"lenName":16,"lenType":16,"lenVar":40},"kernels_config":{"python":{"delete_cmd_postfix":"","delete_cmd_prefix":"del ","library":"var_list.py","varRefreshCmd":"print(var_dic_list())"},"r":{"delete_cmd_postfix":") ","delete_cmd_prefix":"rm(","library":"var_list.r","varRefreshCmd":"cat(var_dic_list()) "}},"types_to_exclude":["module","function","builtin_function_or_method","instance","_Feature"],"window_display":false}},"cells":[{"cell_type":"markdown","metadata":{"id":"5F8r2lMvO8DK"},"source":["<div>\n","<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width=\"300\">\n","</div>"]},{"cell_type":"markdown","metadata":{"id":"un_uIpcOO8DN"},"source":["# Lab 3.1.5\n","# *Neo4j and Python*"]},{"cell_type":"markdown","metadata":{"id":"-YemD-6pO8DP"},"source":["## Introduction\n","\n","Neo4j is the most popular graph database. Free versions include the Desktop (Developer) edition and the Community Server edition (which we can drive from Python).\n","\n","We will begin this lab by working through the tutorial embedded in the Neo4j *start* page to learn about graph databases structures and the Cypher query language. We will then see how to integrate a Neo4j database with a Python program."]},{"cell_type":"markdown","metadata":{"id":"Ai8wEYp3O8DS"},"source":["The Community Server version can be downloaded here: https://neo4j.com/download-center/#releases\n"]},{"cell_type":"markdown","metadata":{"id":"KIR2I5poO8DT"},"source":["- Go through the *Concepts* tutorial.\n","- At the end, click *Intro* under *Keep getting started* heading and go through the tutorial.\n","- At the end, click *Cypher* under *Keep getting started* heading and go through the tutorial.\n","- At the end, click *The Movie Graph* under *Jump into code* heading and go through the tutorial.\n"]},{"cell_type":"markdown","metadata":{"id":"8gp9e-7nO8DW"},"source":["## Driving Neo4j from Python\n","\n","There are a variety of Python libraries for Neo4j, some of which provide more compact (and simpler) ways of executing commands. To avoid having to learn too many different ways of doing the same thing, however, we will use the official one, which is based on the syntax of the Cypher query language."]},{"cell_type":"markdown","metadata":{"id":"vf3d3mQKO8DX"},"source":["The ***Neo4j Bolt Driver for Python*** is documented at https://neo4j.com/docs/api/python-driver/current/."]},{"cell_type":"code","metadata":{"id":"iAJfHh2rO8DZ"},"source":["from neo4j import GraphDatabase\n","\n","uri = \"bolt://localhost:7687\""],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"VdogqeJoO8Dg"},"source":["driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"your_password\"))"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"KAvfzQKDO8Dk"},"source":["To execute a query against a database using this driver, we need to wrap the Cypher query string in a function definition and pass the function to the `read_transaction` method of the `session` object. Our query function then has access to the `tx` object.\n","\n","Here is a function that finds all the movies that the requested `Person` acted in:"]},{"cell_type":"code","metadata":{"id":"n8w6oQj1O8Dm"},"source":["def print_movies_by(tx, name):\n","    for record in tx.run(\"MATCH (a:Person)-[:ACTED_IN]->(anyMovies) \"\n","                         \"WHERE a.name = $name \"\n","                         \"RETURN anyMovies\", name = name):\n","        print(record[\"anyMovies\"])"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"P_l_xiGJO8Dr"},"source":["Here is how to use it to list Tom Hanks' movies:"]},{"cell_type":"code","metadata":{"id":"L1DoP3_fO8Du","outputId":"98fa12b8-80d1-40fb-ca95-5fa624f27738"},"source":["with driver.session() as session:\n","    session.read_transaction(print_movies_by, \"Tom Hanks\")"],"execution_count":null,"outputs":[{"output_type":"stream","text":["<Node id=144 labels=frozenset({'Movie'}) properties={'title': 'Apollo 13', 'tagline': 'Houston, we have a problem.', 'released': 1995}>\n","<Node id=67 labels=frozenset({'Movie'}) properties={'title': \"You've Got Mail\", 'tagline': 'At odds in life... in love on-line.', 'released': 1998}>\n","<Node id=162 labels=frozenset({'Movie'}) properties={'title': 'A League of Their Own', 'tagline': 'Once in a lifetime you get a chance to do something different.', 'released': 1992}>\n","<Node id=78 labels=frozenset({'Movie'}) properties={'title': 'Joe Versus the Volcano', 'tagline': 'A story of love, lava and burning desire.', 'released': 1990}>\n","<Node id=85 labels=frozenset({'Movie'}) properties={'title': 'That Thing You Do', 'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'released': 1996}>\n","<Node id=111 labels=frozenset({'Movie'}) properties={'title': 'The Da Vinci Code', 'tagline': 'Break The Codes', 'released': 2006}>\n","<Node id=105 labels=frozenset({'Movie'}) properties={'title': 'Cloud Atlas', 'tagline': 'Everything is connected', 'released': 2012}>\n","<Node id=150 labels=frozenset({'Movie'}) properties={'title': 'Cast Away', 'tagline': 'At the edge of the world, his journey begins.', 'released': 2000}>\n","<Node id=130 labels=frozenset({'Movie'}) properties={'title': 'The Green Mile', 'tagline': \"Walk a mile you'll never forget.\", 'released': 1999}>\n","<Node id=73 labels=frozenset({'Movie'}) properties={'title': 'Sleepless in Seattle', 'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?', 'released': 1993}>\n","<Node id=161 labels=frozenset({'Movie'}) properties={'title': 'The Polar Express', 'tagline': 'This Holiday Season… Believe', 'released': 2004}>\n","<Node id=159 labels=frozenset({'Movie'}) properties={'title': \"Charlie Wilson's War\", 'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\", 'released': 2007}>\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"Q869a7khO8D0"},"source":["Clearly, some further wrangling is required to produce neat output. (Read the documentation before you attempt this.)"]},{"cell_type":"markdown","metadata":{"id":"P3JbqWLZO8D1"},"source":["In fact, both the method of using the Neo4j Bolt Driver and the data returned by it are unwieldy. This is typical of low-level drivers."]},{"cell_type":"markdown","metadata":{"id":"SxHkq23vO8D2"},"source":["Try building and running some more queries based on the code in examples queries in The Movie Graph tutorial."]},{"cell_type":"code","metadata":{"id":"zdZ8KkfLO8D3"},"source":[],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"_lVs9hRnO8D6"},"source":[],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"821XnEXtO8D7"},"source":["## - END -"]},{"cell_type":"code","metadata":{"id":"h3YxAkCYPH2y"},"source":[],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"VUaoDruyPDAz"},"source":[">"]},{"cell_type":"markdown","metadata":{"id":"fWOk43cgN71c"},"source":["\n","\n","---\n","\n","\n","\n","---\n","\n","\n","\n","> > > > > > > > > © 2023 Institute of Data\n","\n","\n","---\n","\n","\n","\n","---\n","\n","\n","\n"]}]}